{"modelTopology": {"keras_version": "2.1.3", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 608, 608, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1"}, "name": "batch_normalization_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_1"}, "name": "leaky_re_lu_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_2"}, "name": "batch_normalization_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_2"}, "name": "leaky_re_lu_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_3"}, "name": "batch_normalization_3"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_3"}, "name": "leaky_re_lu_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_4"}, "name": "batch_normalization_4"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_4"}, "name": "leaky_re_lu_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_5"}, "name": "batch_normalization_5"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_5"}, "name": "leaky_re_lu_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_6"}, "name": "batch_normalization_6"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_6"}, "name": "leaky_re_lu_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_7"}, "name": "batch_normalization_7"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_7"}, "name": "leaky_re_lu_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_8"}, "name": "batch_normalization_8"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_8"}, "name": "leaky_re_lu_8"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_9"}, "name": "batch_normalization_9"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_9"}, "name": "leaky_re_lu_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_10"}, "name": "batch_normalization_10"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_10"}, "name": "leaky_re_lu_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_11"}, "name": "batch_normalization_11"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_11"}, "name": "leaky_re_lu_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_12"}, "name": "batch_normalization_12"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_12"}, "name": "leaky_re_lu_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_13"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_13"}, "name": "batch_normalization_13"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_13"}, "name": "leaky_re_lu_13"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "config": {"name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_14", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_14"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_14"}, "name": "batch_normalization_14"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_14"}, "name": "leaky_re_lu_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_15", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_15"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_15"}, "name": "batch_normalization_15"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_15"}, "name": "leaky_re_lu_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_16", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_16"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_16"}, "name": "batch_normalization_16"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_16"}, "name": "leaky_re_lu_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_17", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_17"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_17"}, "name": "batch_normalization_17"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_17"}, "name": "leaky_re_lu_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_18", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_18"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_18"}, "name": "batch_normalization_18"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_18"}, "name": "leaky_re_lu_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_19", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_19"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_19"}, "name": "batch_normalization_19"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_21", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_21"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_19"}, "name": "leaky_re_lu_19"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_21"}, "name": "batch_normalization_21"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_20", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_20"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_21"}, "name": "leaky_re_lu_21"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_20"}, "name": "batch_normalization_20"}, {"class_name": "Lambda", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "config": {"function": ["4wEAAAAAAAAAAgAAAAQAAABDAAAAcxYAAABkAWQCbAB9AXwBagF8AGQDZASNAlMAKQX6PVRoaW4g\nd3JhcHBlciBmb3IgVGVuc29yZmxvdyBzcGFjZV90b19kZXB0aCB3aXRoIGJsb2NrX3NpemU9Mi7p\nAAAAAE7pAgAAACkB2gpibG9ja19zaXplKQLaCnRlbnNvcmZsb3faDnNwYWNlX3RvX2RlcHRoKQLa\nAXjaAnRmqQByCQAAAPopL2NvbnRlbnQveWFkMmsveWFkMmsvbW9kZWxzL2tlcmFzX3lvbG8ucHna\nEXNwYWNlX3RvX2RlcHRoX3gyGwAAAHMEAAAAAAQIAQ==\n", null, null], "name": "space_to_depth_x2", "trainable": true, "function_type": "lambda", "output_shape_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAc0gAAAB8AGQBGQByMHwAZAIZAHwAZAEZAGQDGgB8AGQDGQBk\nAxoAZAR8AGQFGQAUAGYEUwB8AGQCGQBkBmQGZAR8AGQFGQAUAGYEUwApB/qLRGV0ZXJtaW5lIHNw\nYWNlX3RvX2RlcHRoIG91dHB1dCBzaGFwZSBmb3IgYmxvY2tfc2l6ZT0yLgoKICAgIE5vdGU6IEZv\nciBMYW1iZGEgd2l0aCBUZW5zb3JGbG93IGJhY2tlbmQsIG91dHB1dCBzaGFwZSBtYXkgbm90IGJl\nIG5lZWRlZC4KICAgIOkBAAAA6QAAAADpAgAAAOkEAAAA6QMAAABOqQApAdoLaW5wdXRfc2hhcGVy\nBwAAAHIHAAAA+ikvY29udGVudC95YWQyay95YWQyay9tb2RlbHMva2VyYXNfeW9sby5wedoec3Bh\nY2VfdG9fZGVwdGhfeDJfb3V0cHV0X3NoYXBlIwAAAHMEAAAAAAY6AQ==\n", null, null], "arguments": {}}, "name": "space_to_depth_x2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_20"}, "name": "leaky_re_lu_20"}, {"class_name": "Concatenate", "inbound_nodes": [[["space_to_depth_x2", 0, 0, {}], ["leaky_re_lu_20", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_22", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_22"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_22"}, "name": "batch_normalization_22"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_22"}, "name": "leaky_re_lu_22"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_23", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 425, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_23"}], "output_layers": [["conv2d_23", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [32], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [256], "name": "batch_normalization_10/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_10/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [512], "name": "batch_normalization_11/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_11/moving_variance"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [256], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_12/moving_variance"}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "shape": [512], "name": "batch_normalization_13/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_13/moving_variance"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [1024], "name": "batch_normalization_14/gamma"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_14/beta"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_14/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_14/moving_variance"}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "shape": [512], "name": "batch_normalization_15/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_15/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_15/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_15/moving_variance"}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "shape": [1024], "name": "batch_normalization_16/gamma"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_16/beta"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_16/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_16/moving_variance"}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "shape": [512], "name": "batch_normalization_17/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_17/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_17/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_17/moving_variance"}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "shape": [1024], "name": "batch_normalization_18/gamma"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_18/beta"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_18/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_18/moving_variance"}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "shape": [1024], "name": "batch_normalization_19/gamma"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_19/beta"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_19/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_19/moving_variance"}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_variance"}]}, {"paths": ["group13-shard1of1"], "weights": [{"dtype": "float32", "shape": [1024], "name": "batch_normalization_20/gamma"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_20/beta"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_20/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_20/moving_variance"}]}, {"paths": ["group14-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_21/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_21/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_21/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_21/moving_variance"}]}, {"paths": ["group15-shard1of1"], "weights": [{"dtype": "float32", "shape": [1024], "name": "batch_normalization_22/gamma"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_22/beta"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_22/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_22/moving_variance"}]}, {"paths": ["group16-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_variance"}]}, {"paths": ["group17-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/moving_variance"}]}, {"paths": ["group18-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_5/moving_variance"}]}, {"paths": ["group19-shard1of1"], "weights": [{"dtype": "float32", "shape": [256], "name": "batch_normalization_6/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/moving_variance"}]}, {"paths": ["group20-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_7/moving_variance"}]}, {"paths": ["group21-shard1of1"], "weights": [{"dtype": "float32", "shape": [256], "name": "batch_normalization_8/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_8/moving_variance"}]}, {"paths": ["group22-shard1of1"], "weights": [{"dtype": "float32", "shape": [512], "name": "batch_normalization_9/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/moving_variance"}]}, {"paths": ["group23-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv2d_1/kernel"}]}, {"paths": ["group24-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 512, 256], "name": "conv2d_10/kernel"}]}, {"paths": ["group25-shard1of2", "group25-shard2of2"], "weights": [{"dtype": "float32", "shape": [3, 3, 256, 512], "name": "conv2d_11/kernel"}]}, {"paths": ["group26-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 512, 256], "name": "conv2d_12/kernel"}]}, {"paths": ["group27-shard1of2", "group27-shard2of2"], "weights": [{"dtype": "float32", "shape": [3, 3, 256, 512], "name": "conv2d_13/kernel"}]}, {"paths": ["group28-shard1of5", "group28-shard2of5", "group28-shard3of5", "group28-shard4of5", "group28-shard5of5"], "weights": [{"dtype": "float32", "shape": [3, 3, 512, 1024], "name": "conv2d_14/kernel"}]}, {"paths": ["group29-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 1024, 512], "name": "conv2d_15/kernel"}]}, {"paths": ["group30-shard1of5", "group30-shard2of5", "group30-shard3of5", "group30-shard4of5", "group30-shard5of5"], "weights": [{"dtype": "float32", "shape": [3, 3, 512, 1024], "name": "conv2d_16/kernel"}]}, {"paths": ["group31-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 1024, 512], "name": "conv2d_17/kernel"}]}, {"paths": ["group32-shard1of5", "group32-shard2of5", "group32-shard3of5", "group32-shard4of5", "group32-shard5of5"], "weights": [{"dtype": "float32", "shape": [3, 3, 512, 1024], "name": "conv2d_18/kernel"}]}, {"paths": ["group33-shard1of9", "group33-shard2of9", "group33-shard3of9", "group33-shard4of9", "group33-shard5of9", "group33-shard6of9", "group33-shard7of9", "group33-shard8of9", "group33-shard9of9"], "weights": [{"dtype": "float32", "shape": [3, 3, 1024, 1024], "name": "conv2d_19/kernel"}]}, {"paths": ["group34-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_2/kernel"}]}, {"paths": ["group35-shard1of9", "group35-shard2of9", "group35-shard3of9", "group35-shard4of9", "group35-shard5of9", "group35-shard6of9", "group35-shard7of9", "group35-shard8of9", "group35-shard9of9"], "weights": [{"dtype": "float32", "shape": [3, 3, 1024, 1024], "name": "conv2d_20/kernel"}]}, {"paths": ["group36-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 512, 64], "name": "conv2d_21/kernel"}]}, {"paths": ["group37-shard1of12", "group37-shard2of12", "group37-shard3of12", "group37-shard4of12", "group37-shard5of12", "group37-shard6of12", "group37-shard7of12", "group37-shard8of12", "group37-shard9of12", "group37-shard10of12", "group37-shard11of12", "group37-shard12of12"], "weights": [{"dtype": "float32", "shape": [3, 3, 1280, 1024], "name": "conv2d_22/kernel"}]}, {"paths": ["group38-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 1024, 425], "name": "conv2d_23/kernel"}, {"dtype": "float32", "shape": [425], "name": "conv2d_23/bias"}]}, {"paths": ["group39-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 64, 128], "name": "conv2d_3/kernel"}]}, {"paths": ["group40-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 128, 64], "name": "conv2d_4/kernel"}]}, {"paths": ["group41-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 64, 128], "name": "conv2d_5/kernel"}]}, {"paths": ["group42-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 128, 256], "name": "conv2d_6/kernel"}]}, {"paths": ["group43-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_7/kernel"}]}, {"paths": ["group44-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 128, 256], "name": "conv2d_8/kernel"}]}, {"paths": ["group45-shard1of2", "group45-shard2of2"], "weights": [{"dtype": "float32", "shape": [3, 3, 256, 512], "name": "conv2d_9/kernel"}]}]}